rfblue2/pic-disassembler/src/include/P16F946.INC
;----- LCDDATA13 Bits -----------------------------------------------------
SEG32            EQU  H'0000'
SEG33            EQU  H'0001'
SEG34            EQU  H'0002'
SEG35            EQU  H'0003'
SEG36            EQU  H'0004'
SEG37            EQU  H'0005'
SEG38            EQU  H'0006'
SEG39            EQU  H'0007'

SEG32COM0        EQU  H'0000'
SEG33COM0        EQU  H'0001'
SEG34COM0        EQU  H'0002'
SEG35COM0        EQU  H'0003'
SEG36COM0        EQU  H'0004'
SEG37COM0        EQU  H'0005'
SEG38COM0        EQU  H'0006'
SEG39COM0        EQU  H'0007'

S32C0            EQU  H'0000'
S33C0            EQU  H'0001'
S34C0            EQU  H'0002'
S35C0            EQU  H'0003'
S36C0            EQU  H'0004'
S37C0            EQU  H'0005'
S38C0            EQU  H'0006'
S39C0            EQU  H'0007'


;----- LCDDATA14 Bits -----------------------------------------------------
SEG40            EQU  H'0000'
SEG41            EQU  H'0001'

SEG40COM0        EQU  H'0000'
SEG41COM0        EQU  H'0001'

S40C0            EQU  H'0000'
S41C0            EQU  H'0001'


;----- LCDDATA15 Bits -----------------------------------------------------
SEG24            EQU  H'0000'
SEG25            EQU  H'0001'
SEG26            EQU  H'0002'
SEG27            EQU  H'0003'
SEG28            EQU  H'0004'
SEG29            EQU  H'0005'
SEG30            EQU  H'0006'
SEG31            EQU  H'0007'

SEG24COM1        EQU  H'0000'
SEG25COM1        EQU  H'0001'
SEG26COM1        EQU  H'0002'
SEG27COM1        EQU  H'0003'
SEG28COM1        EQU  H'0004'
SEG29COM1        EQU  H'0005'
SEG30COM1        EQU  H'0006'
SEG31COM1        EQU  H'0007'

S24C1            EQU  H'0000'
S25C1            EQU  H'0001'
S26C1            EQU  H'0002'
S27C1            EQU  H'0003'
S28C1            EQU  H'0004'
S29C1            EQU  H'0005'
S30C1            EQU  H'0006'
S31C1            EQU  H'0007'


;----- LCDDATA16 Bits -----------------------------------------------------
SEG32            EQU  H'0000'
SEG33            EQU  H'0001'
SEG34            EQU  H'0002'
SEG35            EQU  H'0003'
SEG36            EQU  H'0004'
SEG37            EQU  H'0005'
SEG38            EQU  H'0006'
SEG39            EQU  H'0007'

SEG32COM1        EQU  H'0000'
SEG33COM1        EQU  H'0001'
SEG34COM1        EQU  H'0002'
SEG35COM1        EQU  H'0003'
SEG36COM1        EQU  H'0004'
SEG37COM1        EQU  H'0005'
SEG38COM1        EQU  H'0006'
SEG39COM1        EQU  H'0007'

S32C1            EQU  H'0000'
S33C1            EQU  H'0001'
S34C1            EQU  H'0002'
S35C1            EQU  H'0003'
S36C1            EQU  H'0004'
S37C1            EQU  H'0005'
S38C1            EQU  H'0006'
S39C1            EQU  H'0007'


;----- LCDDATA17 Bits -----------------------------------------------------
SEG40            EQU  H'0000'
SEG41            EQU  H'0001'

SEG40COM1        EQU  H'0000'
SEG41COM1        EQU  H'0001'

S40C1            EQU  H'0000'
S41C1            EQU  H'0001'


;----- LCDDATA18 Bits -----------------------------------------------------
SEG24            EQU  H'0000'
SEG25            EQU  H'0001'
SEG26            EQU  H'0002'
SEG27            EQU  H'0003'
SEG28            EQU  H'0004'
SEG29            EQU  H'0005'
SEG30            EQU  H'0006'
SEG31            EQU  H'0007'

SEG24COM2        EQU  H'0000'
SEG25COM2        EQU  H'0001'
SEG26COM2        EQU  H'0002'
SEG27COM2        EQU  H'0003'
SEG28COM2        EQU  H'0004'
SEG29COM2        EQU  H'0005'
SEG30COM2        EQU  H'0006'
SEG31COM2        EQU  H'0007'

S24C2            EQU  H'0000'
S25C2            EQU  H'0001'
S26C2            EQU  H'0002'
S27C2            EQU  H'0003'
S28C2            EQU  H'0004'
S29C2            EQU  H'0005'
S30C2            EQU  H'0006'
S31C2            EQU  H'0007'


;----- LCDDATA19 Bits -----------------------------------------------------
SEG32            EQU  H'0000'
SEG33            EQU  H'0001'
SEG34            EQU  H'0002'
SEG35            EQU  H'0003'
SEG36            EQU  H'0004'
SEG37            EQU  H'0005'
SEG38            EQU  H'0006'
SEG39            EQU  H'0007'

SEG32COM2        EQU  H'0000'
SEG33COM2        EQU  H'0001'
SEG34COM2        EQU  H'0002'
SEG35COM2        EQU  H'0003'
SEG36COM2        EQU  H'0004'
SEG37COM2        EQU  H'0005'
SEG38COM2        EQU  H'0006'
SEG39COM2        EQU  H'0007'

S32C2            EQU  H'0000'
S33C2            EQU  H'0001'
S34C2            EQU  H'0002'
S35C2            EQU  H'0003'
S36C2            EQU  H'0004'
S37C2            EQU  H'0005'
S38C2            EQU  H'0006'
S39C2            EQU  H'0007'


;----- LCDDATA20 Bits -----------------------------------------------------
SEG40            EQU  H'0000'
SEG41            EQU  H'0001'

SEG40COM2        EQU  H'0000'
SEG41COM2        EQU  H'0001'

S40C2            EQU  H'0000'
S41C2            EQU  H'0001'


;----- LCDDATA21 Bits -----------------------------------------------------
SEG24            EQU  H'0000'
SEG25            EQU  H'0001'
SEG26            EQU  H'0002'
SEG27            EQU  H'0003'
SEG28            EQU  H'0004'
SEG29            EQU  H'0005'
SEG30            EQU  H'0006'
SEG31            EQU  H'0007'

SEG24COM3        EQU  H'0000'
SEG25COM3        EQU  H'0001'
SEG26COM3        EQU  H'0002'
SEG27COM3        EQU  H'0003'
SEG28COM3        EQU  H'0004'
SEG29COM3        EQU  H'0005'
SEG30COM3        EQU  H'0006'
SEG31COM3        EQU  H'0007'

S24C3            EQU  H'0000'
S25C3            EQU  H'0001'
S26C3            EQU  H'0002'
S27C3            EQU  H'0003'
S28C3            EQU  H'0004'
S29C3            EQU  H'0005'
S30C3            EQU  H'0006'
S31C3            EQU  H'0007'


;----- LCDDATA22 Bits -----------------------------------------------------
SEG32            EQU  H'0000'
SEG33            EQU  H'0001'
SEG34            EQU  H'0002'
SEG35            EQU  H'0003'
SEG36            EQU  H'0004'
SEG37            EQU  H'0005'
SEG38            EQU  H'0006'
SEG39            EQU  H'0007'

